% -----------------------------------------------------------------------------
% Function    : Qnb2dcm 四元数转方向余弦矩阵(旋转矩阵)
% Description : Qnb转Cbn,Qnb是从N系到B系的四元数。Cbn表示从B系到N系转换的旋转矩阵
%               四元数到旋转矩阵的转换和欧拉角的旋转顺序无关。是通用的转换函数
% Author      : logzhan
% Date        : 2023-01-05
% -----------------------------------------------------------------------------
function Cbn = Qnb2Cbn(Qnb) 
Cbn=[Qnb(1)^2+Qnb(2)^2-Qnb(3)^2-Qnb(4)^2    2*(Qnb(2)*Qnb(3)-Qnb(1)*Qnb(4))       2*(Qnb(2)*Qnb(4)+Qnb(1)*Qnb(3))
     2*(Qnb(2)*Qnb(3)+Qnb(1)*Qnb(4))        Qnb(1)^2-Qnb(2)^2+Qnb(3)^2-Qnb(4)^2   2*(Qnb(3)*Qnb(4)-Qnb(1)*Qnb(2))
     2*(Qnb(2)*Qnb(4)-Qnb(1)*Qnb(3))        2*(Qnb(3)*Qnb(4)+Qnb(1)*Qnb(2))       Qnb(1)^2-Qnb(2)^2-Qnb(3)^2+Qnb(4)^2];
end


% 四元数转矩阵,下面的写法计算量略小些
% q0=q(1);
% q1=q(2);
% q2=q(3);
% q3=q(4);
% 
% q00=q0*q0;
% q11=q1*q1;
% q22=q2*q2;
% q33=q3*q3;
% 
% c=zeros(3,3);
% c(1,1)=q00+q11-q22-q33;
% c(1,2)=2*(q1*q2-q0*q3);
% c(1,3)=2*(q1*q3+q0*q2);
% c(2,1)=2*(q1*q2+q0*q3);
% c(2,2)=q00-q11+q22-q33;
% c(2,3)=2*(q2*q3-q0*q1);
% c(3,1)=2*(q1*q3-q0*q2);
% c(3,2)=2*(q2*q3+q0*q1);
% c(3,3)=q00-q11-q22+q33;